#casks - for extra funtionality
tap "homebrew/bundle"                     # bundler for non ruby dependencies
tap "buo/cask-upgrade"                    # to upgrade all the apps installed by homebrew cask
tap "homebrew/core"                       # default tap installed - for linux use "homebrew/linux-brew/core"

# Unix tools
brew "git"
brew "openssl"
brew "readline"     # Utilities that one needs....

# GitHub
brew "hub"

# Programming language prerequisites and package managers
brew "libyaml"              # should come after openssl
brew "coreutils"
brew "jq"

# development tools
brew "go"               # needed for docker
brew "go-md2man"        # needed for docker
cask "docker"           # docker - containerise all the things
cask "iterm2"           # item - terminal alternative
cask "postman"          # Postman - for API development and testing

# video viewer
cask "vlc"

# slack
cask "slack"

# we're GCP command line tools
cask "google-cloud-sdk"
